vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/middleware/usb/pd/ptn5110/usb_pd_ptn5110_register.h
/*
 * Copyright 2015 - 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __PD_PTN5110_REGISTER_H__
#define __PD_PTN5110_REGISTER_H__

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define TCPC_VERSION_MAJOR 1
#define TCPC_VERSION_MINOR 0

/* VENDOR_ID : */
#define TCPC_VENDOR_ID_IDX 0x00U

/* PRODUCT_ID : */
#define TCPC_PRODUCT_ID_IDX 0x02U

/* DEVICE_ID : */
#define TCPC_DEVICE_ID_IDX 0x04U

/* USBTYPEC_REV : */
#define TCPC_USBTYPEC_REV_IDX                      0x06U
#define TCPC_USBTYPEC_REV_USB_TYPE_C_REVISION_MSB  7U
#define TCPC_USBTYPEC_REV_USB_TYPE_C_REVISION_LSB  0U
#define TCPC_USBTYPEC_REV_USB_TYPE_C_REVISION_MASK 0x00FFU

/* USBPD_REV_VER : */
#define TCPC_USBPD_REV_VER_IDX                     0x08U
#define TCPC_USBPD_REV_VER_BCD_USBPD_REVISION_MSB  15U
#define TCPC_USBPD_REV_VER_BCD_USBPD_REVISION_LSB  8U
#define TCPC_USBPD_REV_VER_BCD_USBPD_REVISION_MASK 0xFF00U
#define TCPC_USBPD_REV_VER_BCD_USBPD_VERSION_MSB   7U
#define TCPC_USBPD_REV_VER_BCD_USBPD_VERSION_LSB   0U
#define TCPC_USBPD_REV_VER_BCD_USBPD_VERSION_MASK  0x00FFU

/* PD_INTERFACE_REV : */
#define TCPC_PD_INTERFACE_REV_IDX                                               0x0AU
#define TCPC_PD_INTERFACE_REV_BCD_USBPD_INTER_BLOCK_SPECIFICATION_REVISION_MSB  15U
#define TCPC_PD_INTERFACE_REV_BCD_USBPD_INTER_BLOCK_SPECIFICATION_REVISION_LSB  8U
#define TCPC_PD_INTERFACE_REV_BCD_USBPD_INTER_BLOCK_SPECIFICATION_REVISION_MASK 0xFF00U
#define TCPC_PD_INTERFACE_REV_BCD_USBPD_INTER_BLOCK_SPECIFICATION_VERSION_MSB   7U
#define TCPC_PD_INTERFACE_REV_BCD_USBPD_INTER_BLOCK_SPECIFICATION_VERSION_LSB   0U
#define TCPC_PD_INTERFACE_REV_BCD_USBPD_INTER_BLOCK_SPECIFICATION_VERSION_MASK  0x00FFU

/* ALERT : */
#define TCPC_ALERT_IDX                                  0x10U
#define TCPC_ALERT_VENDOR_DEFINED_EXTENDED_MSB          15U
#define TCPC_ALERT_VENDOR_DEFINED_EXTENDED_LSB          15U
#define TCPC_ALERT_VENDOR_DEFINED_EXTENDED_MASK         0x8000U
#define TCPC_ALERT_ALERT_EXTENDED_MSB                   14U
#define TCPC_ALERT_ALERT_EXTENDED_LSB                   14U
#define TCPC_ALERT_ALERT_EXTENDED_MASK                  0x4000U
#define TCPC_ALERT_EXTENDED_STATUS_MSB                  13U
#define TCPC_ALERT_EXTENDED_STATUS_LSB                  13U
#define TCPC_ALERT_EXTENDED_STATUS_MASK                 0x2000U
#define TCPC_ALERT_BEGINNING_SOP_MESSAGE_STATUS_MSB     12U
#define TCPC_ALERT_BEGINNING_SOP_MESSAGE_STATUS_LSB     12U
#define TCPC_ALERT_BEGINNING_SOP_MESSAGE_STATUS_MASK    0x1000U
#define TCPC_ALERT_VBUS_SINK_DISCONNECT_DETECTED_MSB    11U
#define TCPC_ALERT_VBUS_SINK_DISCONNECT_DETECTED_LSB    11U
#define TCPC_ALERT_VBUS_SINK_DISCONNECT_DETECTED_MASK   0x0800U
#define TCPC_ALERT_RX_BUFFER_OVERFLOW_MSB               10U
#define TCPC_ALERT_RX_BUFFER_OVERFLOW_LSB               10U
#define TCPC_ALERT_RX_BUFFER_OVERFLOW_MASK              0x0400U
#define TCPC_ALERT_FAULT_MSB                            9U
#define TCPC_ALERT_FAULT_LSB                            9U
#define TCPC_ALERT_FAULT_MASK                           0x0200U
#define TCPC_ALERT_VBUS_VOLTAGE_ALARM_LO_MSB            8U
#define TCPC_ALERT_VBUS_VOLTAGE_ALARM_LO_LSB            8U
#define TCPC_ALERT_VBUS_VOLTAGE_ALARM_LO_MASK           0x0100U
#define TCPC_ALERT_VBUS_VOLTAGE_ALARM_HI_MSB            7U
#define TCPC_ALERT_VBUS_VOLTAGE_ALARM_HI_LSB            7U
#define TCPC_ALERT_VBUS_VOLTAGE_ALARM_HI_MASK           0x0080U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_SUCCESSFUL_MSB  6U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_SUCCESSFUL_LSB  6U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_SUCCESSFUL_MASK 0x0040U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_DISCARDED_MSB   5U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_DISCARDED_LSB   5U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_DISCARDED_MASK  0x0020U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_FAILED_MSB      4U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_FAILED_LSB      4U
#define TCPC_ALERT_TRANSMIT_SOP_MESSAGE_FAILED_MASK     0x0010U
#define TCPC_ALERT_RECEIVED_HARD_RESET_MSB              3U
#define TCPC_ALERT_RECEIVED_HARD_RESET_LSB              3U
#define TCPC_ALERT_RECEIVED_HARD_RESET_MASK             0x0008U
#define TCPC_ALERT_RECEIVE_SOP_MESSAGE_STATUS_MSB       2U
#define TCPC_ALERT_RECEIVE_SOP_MESSAGE_STATUS_LSB       2U
#define TCPC_ALERT_RECEIVE_SOP_MESSAGE_STATUS_MASK      0x0004U
#define TCPC_ALERT_PORT_POWER_STATUS_MSB                1U
#define TCPC_ALERT_PORT_POWER_STATUS_LSB                1U
#define TCPC_ALERT_PORT_POWER_STATUS_MASK               0x0002U
#define TCPC_ALERT_CC_STATUS_ALERT_MSB                  0U
#define TCPC_ALERT_CC_STATUS_ALERT_LSB                  0U
#define TCPC_ALERT_CC_STATUS_ALERT_MASK                 0x0001U

/* ALERT_MASK : */
#define TCPC_ALERT_MASK_IDX                                                    0x12U
#define TCPC_ALERT_MASK_VENDOR_DEFINED_EXTENDED_MASK_MSB                       15U
#define TCPC_ALERT_MASK_VENDOR_DEFINED_EXTENDED_MASK_LSB                       15U
#define TCPC_ALERT_MASK_VENDOR_DEFINED_EXTENDED_MASK_MASK                      0x8000U
#define TCPC_ALERT_MASK_ALERT_EXTENDED_MASK_MSB                                14U
#define TCPC_ALERT_MASK_ALERT_EXTENDED_MASK_LSB                                14U
#define TCPC_ALERT_MASK_ALERT_EXTENDED_MASK_MASK                               0x4000U
#define TCPC_ALERT_MASK_EXTENDED_STATUS_MASK_MSB                               13U
#define TCPC_ALERT_MASK_EXTENDED_STATUS_MASK_LSB                               13U
#define TCPC_ALERT_MASK_EXTENDED_STATUS_MASK_MASK                              0x2000U
#define TCPC_ALERT_MASK_BEGINNING_SOP_MESSAGE_STATUS_MASK_MSB                  12U
#define TCPC_ALERT_MASK_BEGINNING_SOP_MESSAGE_STATUS_MASK_LSB                  12U
#define TCPC_ALERT_MASK_BEGINNING_SOP_MESSAGE_STATUS_MASK_MASK                 0x1000U
#define TCPC_ALERT_MASK_VBUS_SINK_DISCONNECT_DETECTED_MASKED_MSB               11U
#define TCPC_ALERT_MASK_VBUS_SINK_DISCONNECT_DETECTED_MASKED_LSB               11U
#define TCPC_ALERT_MASK_VBUS_SINK_DISCONNECT_DETECTED_MASKED_MASK              0x0800U
#define TCPC_ALERT_MASK_RX_BUFFER_OVERFLOW_MASKED_MSB                          10U
#define TCPC_ALERT_MASK_RX_BUFFER_OVERFLOW_MASKED_LSB                          10U
#define TCPC_ALERT_MASK_RX_BUFFER_OVERFLOW_MASKED_MASK                         0x0400U
#define TCPC_ALERT_MASK_FAULT_MASKED_MSB                                       9U
#define TCPC_ALERT_MASK_FAULT_MASKED_LSB                                       9U
#define TCPC_ALERT_MASK_FAULT_MASKED_MASK                                      0x0200U
#define TCPC_ALERT_MASK_VBUS_VOLTAGE_ALARM_LO_MASKED_MSB                       8U
#define TCPC_ALERT_MASK_VBUS_VOLTAGE_ALARM_LO_MASKED_LSB                       8U
#define TCPC_ALERT_MASK_VBUS_VOLTAGE_ALARM_LO_MASKED_MASK                      0x0100U
#define TCPC_ALERT_MASK_VBUS_VOLTAGE_ALARM_HI_MASKED_MSB                       7U
#define TCPC_ALERT_MASK_VBUS_VOLTAGE_ALARM_HI_MASKED_LSB                       7U
#define TCPC_ALERT_MASK_VBUS_VOLTAGE_ALARM_HI_MASKED_MASK                      0x0080U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_SUCCESSFUL_INTERRUPT_MASK_MSB     6U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_SUCCESSFUL_INTERRUPT_MASK_LSB     6U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_SUCCESSFUL_INTERRUPT_MASK_MASK    0x0040U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_DISCARDED_INTERRUPT_MASK_MSB      5U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_DISCARDED_INTERRUPT_MASK_LSB      5U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_DISCARDED_INTERRUPT_MASK_MASK     0x0020U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_FAILED_INTERRUPT_MASK_MSB         4U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_FAILED_INTERRUPT_MASK_LSB         4U
#define TCPC_ALERT_MASK_TRANSMIT_SOP_MESSAGE_FAILED_INTERRUPT_MASK_MASK        0x0010U
#define TCPC_ALERT_MASK_RECEIVED_HARD_RESET_MESSAGE_STATUS_INTERRUPT_MASK_MSB  3U
#define TCPC_ALERT_MASK_RECEIVED_HARD_RESET_MESSAGE_STATUS_INTERRUPT_MASK_LSB  3U
#define TCPC_ALERT_MASK_RECEIVED_HARD_RESET_MESSAGE_STATUS_INTERRUPT_MASK_MASK 0x0008U
#define TCPC_ALERT_MASK_RECEIVE_SOP_MESSAGE_STATUS_INTERRUPT_MASK_MSB          2U
#define TCPC_ALERT_MASK_RECEIVE_SOP_MESSAGE_STATUS_INTERRUPT_MASK_LSB          2U
#define TCPC_ALERT_MASK_RECEIVE_SOP_MESSAGE_STATUS_INTERRUPT_MASK_MASK         0x0004U
#define TCPC_ALERT_MASK_PORT_POWER_STATUS_INTERRUPT_MASK_MSB                   1U
#define TCPC_ALERT_MASK_PORT_POWER_STATUS_INTERRUPT_MASK_LSB                   1U
#define TCPC_ALERT_MASK_PORT_POWER_STATUS_INTERRUPT_MASK_MASK                  0x0002U
#define TCPC_ALERT_MASK_CC_STATUS_INTERRUPT_MASK_MSB                           0U
#define TCPC_ALERT_MASK_CC_STATUS_INTERRUPT_MASK_LSB                           0U
#define TCPC_ALERT_MASK_CC_STATUS_INTERRUPT_MASK_MASK                          0x0001U

/* POWER_STATUS_MASK : */
#define TCPC_POWER_STATUS_MASK_IDX                                               0x14U
#define TCPC_POWER_STATUS_MASK_DEBUG_ACCESSORY_CONNECTED_INTERRUPT_MASK_MSB      7U
#define TCPC_POWER_STATUS_MASK_DEBUG_ACCESSORY_CONNECTED_INTERRUPT_MASK_LSB      7U
#define TCPC_POWER_STATUS_MASK_DEBUG_ACCESSORY_CONNECTED_INTERRUPT_MASK_MASK     0x0080U
#define TCPC_POWER_STATUS_MASK_TCPC_INITIALIZATION_STATUS_INTERRUPT_MASK_MSB     6U
#define TCPC_POWER_STATUS_MASK_TCPC_INITIALIZATION_STATUS_INTERRUPT_MASK_LSB     6U
#define TCPC_POWER_STATUS_MASK_TCPC_INITIALIZATION_STATUS_INTERRUPT_MASK_MASK    0x0040U
#define TCPC_POWER_STATUS_MASK_SOURCE_HIGH_VOLTAGE_STATUS_INTERRUPT_MASK_MSB     5U
#define TCPC_POWER_STATUS_MASK_SOURCE_HIGH_VOLTAGE_STATUS_INTERRUPT_MASK_LSB     5U
#define TCPC_POWER_STATUS_MASK_SOURCE_HIGH_VOLTAGE_STATUS_INTERRUPT_MASK_MASK    0x0020U
#define TCPC_POWER_STATUS_MASK_SOURCE_VBUS_STATUS_INTERRUPT_MASK_MSB             4U
#define TCPC_POWER_STATUS_MASK_SOURCE_VBUS_STATUS_INTERRUPT_MASK_LSB             4U
#define TCPC_POWER_STATUS_MASK_SOURCE_VBUS_STATUS_INTERRUPT_MASK_MASK            0x0010U
#define TCPC_POWER_STATUS_MASK_VBUS_PRESENT_DETECTION_STATUS_INTERRUPT_MASK_MSB  3U
#define TCPC_POWER_STATUS_MASK_VBUS_PRESENT_DETECTION_STATUS_INTERRUPT_MASK_LSB  3U
#define TCPC_POWER_STATUS_MASK_VBUS_PRESENT_DETECTION_STATUS_INTERRUPT_MASK_MASK 0x0008U
#define TCPC_POWER_STATUS_MASK_VBUS_PRESENT_STATUS_INTERRUPT_MASK_MSB            2U
#define TCPC_POWER_STATUS_MASK_VBUS_PRESENT_STATUS_INTERRUPT_MASK_LSB            2U
#define TCPC_POWER_STATUS_MASK_VBUS_PRESENT_STATUS_INTERRUPT_MASK_MASK           0x0004U
#define TCPC_POWER_STATUS_MASK_VCONN_PRESENT_STATUS_INTERRUPT_MASK_MSB           1U
#define TCPC_POWER_STATUS_MASK_VCONN_PRESENT_STATUS_INTERRUPT_MASK_LSB           1U
#define TCPC_POWER_STATUS_MASK_VCONN_PRESENT_STATUS_INTERRUPT_MASK_MASK          0x0002U
#define TCPC_POWER_STATUS_MASK_SINK_VBUS_CONNECTED_STATUS_INTERRUPT_MASK_MSB     0U
#define TCPC_POWER_STATUS_MASK_SINK_VBUS_CONNECTED_STATUS_INTERRUPT_MASK_LSB     0U
#define TCPC_POWER_STATUS_MASK_SINK_VBUS_CONNECTED_STATUS_INTERRUPT_MASK_MASK    0x0001U

/* FAULT_STATUS_MASK : */
#define TCPC_FAULT_STATUS_MASK_IDX                                                           0x15U
#define TCPC_FAULT_STATUS_MASK_ALL_REGISTERS_RESET_TO_DEFAULT_INTERRUPT_STATUS_MASK_MSB      7U
#define TCPC_FAULT_STATUS_MASK_ALL_REGISTERS_RESET_TO_DEFAULT_INTERRUPT_STATUS_MASK_LSB      7U
#define TCPC_FAULT_STATUS_MASK_ALL_REGISTERS_RESET_TO_DEFAULT_INTERRUPT_STATUS_MASK_MASK     0x0080U
#define TCPC_FAULT_STATUS_MASK_FORCE_OFF_VBUS_INTERRUPT_STATUS_MASK_MSB                      6U
#define TCPC_FAULT_STATUS_MASK_FORCE_OFF_VBUS_INTERRUPT_STATUS_MASK_LSB                      6U
#define TCPC_FAULT_STATUS_MASK_FORCE_OFF_VBUS_INTERRUPT_STATUS_MASK_MASK                     0x0040U
#define TCPC_FAULT_STATUS_MASK_AUTO_DISCHARGE_FAILED_INTERRUPT_STATUS_MASK_MSB               5U
#define TCPC_FAULT_STATUS_MASK_AUTO_DISCHARGE_FAILED_INTERRUPT_STATUS_MASK_LSB               5U
#define TCPC_FAULT_STATUS_MASK_AUTO_DISCHARGE_FAILED_INTERRUPT_STATUS_MASK_MASK              0x0020U
#define TCPC_FAULT_STATUS_MASK_FORCE_DISCHARGE_FAILED_INTERRUPT_STATUS_MASK_MSB              4U
#define TCPC_FAULT_STATUS_MASK_FORCE_DISCHARGE_FAILED_INTERRUPT_STATUS_MASK_LSB              4U
#define TCPC_FAULT_STATUS_MASK_FORCE_DISCHARGE_FAILED_INTERRUPT_STATUS_MASK_MASK             0x0010U
#define TCPC_FAULT_STATUS_MASK_VBUS_OVER_CURRENT_PROTECTION_FAULT_INTERRUPT_STATUS_MASK_MSB  3U
#define TCPC_FAULT_STATUS_MASK_VBUS_OVER_CURRENT_PROTECTION_FAULT_INTERRUPT_STATUS_MASK_LSB  3U
#define TCPC_FAULT_STATUS_MASK_VBUS_OVER_CURRENT_PROTECTION_FAULT_INTERRUPT_STATUS_MASK_MASK 0x0008U
#define TCPC_FAULT_STATUS_MASK_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_INTERRUPT_STATUS_MASK_MSB  2U
#define TCPC_FAULT_STATUS_MASK_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_INTERRUPT_STATUS_MASK_LSB  2U
#define TCPC_FAULT_STATUS_MASK_VBUS_OVER_VOLTAGE_PROTECTION_FAULT_INTERRUPT_STATUS_MASK_MASK 0x0004U
#define TCPC_FAULT_STATUS_MASK_VCONN_OVER_CURRENT_FAULT_INTERRUPT_STATUS_MASK_MSB            1U
#define TCPC_FAULT_STATUS_MASK_VCONN_OVER_CURRENT_FAULT_INTERRUPT_STATUS_MASK_LSB            1U
#define TCPC_FAULT_STATUS_MASK_VCONN_OVER_CURRENT_FAULT_INTERRUPT_STATUS_MASK_MASK           0x0002U
#define TCPC_FAULT_STATUS_MASK_I2_C_INTERFACE_ERROR_INTERRUPT_STATUS_MASK_MSB                0U
#define TCPC_FAULT_STATUS_MASK_I2_C_INTERFACE_ERROR_INTERRUPT_STATUS_MASK_LSB                0U
#define TCPC_FAULT_STATUS_MASK_I2_C_INTERFACE_ERROR_INTERRUPT_STATUS_MASK_MASK               0x0001U

