vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/middleware/usb/pd/ptn5110/usb_pd_ptn5110_register.h
typedef enum
{
    TCPC_SEND_FRS                  = 0x23,
    TCPC_START_AMS                 = 0x34,
    TCPC_END_AMS                   = 0x45,
    TCPC_LOOK4_FULL_CONNECTION     = 0x56,
    TCPC_CONNECTION_SWAP_TO_SOURCE = 0x67,
    TCPC_CONNECTION_SWAP_TO_SINK   = 0x78,
    TCPC_CONNECTION_ERROR_RECOVERY = 0x89,

    TCPC_CONNECTION_DISABLED      = 0x9a,
    TCPC_CONNECTION_SOURCE_VCONN  = 0xab,
    TCPC_CONNECTION_DISABLE_VCONN = 0xbc,

    /*_N_EXT_COMMANDS=10, */
} TcpcExtCommand_t;

/* Register: DEVICE_CAPABILITIES_1
 */

/* Field: Source_Resistor_supported : Source Resistor supported
00b: Rp default only
01b: Rp 1.5A and default
10b: Rp 3.0A, 1.5A, and default
11b: Reserved
Rp values which may be configured by the TCPM via the ROLE_CONTROL register
*/

typedef enum
{
    DEVICE_CAPABILITIES_1_SOURCE_RESISTOR_SUPPORTED_RP_DEFAULT_ONLY = 0x0000, /* Rp default only */
    DEVICE_CAPABILITIES_1_SOURCE_RESISTOR_SUPPORTED_RP_1            = 0x0100, /* Rp 1.5A and default */
    DEVICE_CAPABILITIES_1_SOURCE_RESISTOR_SUPPORTED_RP_3            = 0x0200, /* Rp 3.0A, 1.5A, and default */
} Source_Resistor_supported_t;

/* Field: Roles_Supported : Roles Supported
000b: Type-C Port Manager can configure the Port as Source only or Sink only (not DRP)
001b: Source only
010b: Sink only
011b: Sink with accessory support
100b: DRP only
101b: Source, Sink, DRP, Adapter/Cable all supported
110b: Source, Sink, DRP
111b: Not valid
*/

typedef enum
{
    TYPEC_PORT_MANAGER_CAN_CONFIGURE_THE_PORT_AS_SOURCE_ONLY_OR_SINK_ONLY =
        0x00, /* Type-C Port Manager can configure the Port as Source only or Sink only (not DRP) */
    SOURCE_ONLY                                = 0x20, /* Source only */
    SINK_ONLY                                  = 0x40, /* Sink only */
    SINK_WITH_ACCESSORY_SUPPORT                = 0x60, /* Sink with accessory support */
    DRP_ONLY                                   = 0x80, /* DRP only */
    SOURCE_SINK_DRP_ADAPTERCABLE_ALL_SUPPORTED = 0xa0, /* Source, Sink, DRP, Adapter/Cable all supported */
    SOURCE_SINK_DRP                            = 0xc0, /* Source, Sink, DRP */
    NOT_VALID                                  = 0xe0, /* Not valid */
} Roles_Supported_t;

/* Register: DEVICE_CAPABILITIES_2
 */

/* Field: VBUS_Voltage_Alarm_LSB : VBUS Voltage Alarm LSB
00b: TCPC has 25mV LSB for its voltage alarm and uses all 10 bits in VBUS_VOLTAGE_ALARM_HI_CFG and
VBUS_VOLTAGE_ALARM_LO_CFG.
01b: TCPC has 50mV LSB for its voltage alarm and uses only 9 bits. VBUS_VOLTAGE_ALARM_HI_CFG[0] and
VBUS_VOLTAGE_ALARM_LO_CFG[0] are ignored by TCPC.
10: TCPC has 100mV LSB for its voltage alarm and uses only 8 bits. VBUS_VOLTAGE_ALARM_HI_CFG[1:0] and
VBUS_VOLTAGE_ALARM_LO_CFG[1:0] are ignored by TCPC.
11: reserved
Support for VBUS_VOLTAGE_ALARM_LO_CFG and VBUS_VOLTAGE_ALARM_HI implemented
*/

typedef enum
{
    TCPC_HAS_25MV_LSB_FOR_ITS_VOLTAGE_ALARM_AND_USES_ALL_10_BITS_IN_VBUS_VOLTAGE_ALARM_HI_CFG_AND_VBUS_VOLTAGE_ALARM_LO_CFG =
        0x00, /* TCPC has 25mV LSB for its voltage alarm and uses all 10 bits in VBUS_VOLTAGE_ALARM_HI_CFG and */
              /* VBUS_VOLTAGE_ALARM_LO_CFG. */
    TCPC_HAS_50MV_LSB_FOR_ITS_VOLTAGE_ALARM_AND_USES_ONLY_9_BITS =
        0x10, /* TCPC has 50mV LSB for its voltage alarm and uses only 9 bits. VBUS_VOLTAGE_ALARM_HI_CFG[0] and */
              /* VBUS_VOLTAGE_ALARM_LO_CFG[0] are ignored by TCPC. */
    TCPC_HAS_100MV_LSB_FOR_ITS_VOLTAGE_ALARM_AND_USES_ONLY_8_BITS =
        0xa0, /* TCPC has 100mV LSB for its voltage alarm and uses only 8 bits. VBUS_VOLTAGE_ALARM_HI_CFG[1:0] and */
              /* VBUS_VOLTAGE_ALARM_LO_CFG[1:0] are ignored by TCPC. */
} VBUS_Voltage_Alarm_LSB_t;

/* Field: VCONN_Power_Supported : VCONN Power Supported
000b: 1.0W
001b: 1.5W
010b: 2.0W
011b: 3W
100b: 4W
101b: 5W
110b: 6W
111b: External
*/

typedef enum
{
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_0        = 0x00, /* 1.0W */
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_1        = 0x02, /* 1.5W */
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_2        = 0x04, /* 2.0W */
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_3W       = 0x06, /* 3W */
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_4W       = 0x08, /* 4W */
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_5W       = 0x0a, /* 5W */
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_6W       = 0x0c, /* 6W */
    DEVICE_CAPABILITIES_2_VCONN_POWER_SUPPORTED_EXTERNAL = 0x0e, /* External */
} VCONN_Power_Supported_t;

/* Register: RX_BUF_FRAME_TYPE
 */

/* Field: Received_SOP_Message : Received SOP* Message
000b: Received SOP
001b: Received SOP'
010b: Received SOP''
011b: Received SOP_DBG'
100b: Received SOP_DBG''
110b: Received Cable Reset
All others are reserved.
*/

typedef enum
{
    RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_RECEIVED_SOP         = 0x00, /* Received SOP */
    RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_RECEIVED_SOP_P       = 0x01, /* Received SOP' */
    RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_RECEIVED_SOP_PP      = 0x02, /* Received SOP'' */
    RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_RECEIVED_SOP_DBG_P   = 0x03, /* Received SOP_DBG' */
    RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_RECEIVED_SOP_DBG_PP  = 0x04, /* Received SOP_DBG'' */
    RX_BUF_FRAME_TYPE_RECEIVED_SOP_MESSAGE_RECEIVED_CABLE_RESET = 0x06, /* Received Cable Reset */
} Received_SOP_Message_t;

/* Register: TRANSMIT
 */

/* Field: Retry_Counter : Retry Counter
00b: No message retry is required
01b: Automatically retry message transmission once
10b: Automatically retry message transmission twice
11b: Automatically retry message transmission three times
*/

typedef enum
{
    NO_MESSAGE_RETRY_IS_REQUIRED                   = 0x00, /* No message retry is required */
    AUTOMATICALLY_RETRY_MESSAGE_TRANSMISSION_ONCE  = 0x10, /* Automatically retry message transmission once */
    AUTOMATICALLY_RETRY_MESSAGE_TRANSMISSION_TWICE = 0x20, /* Automatically retry message transmission twice */
    AUTOMATICALLY_RETRY_MESSAGE_TRANSMISSION_THREE_TIMES =
        0x30, /* Automatically retry message transmission three times */
} Retry_Counter_t;

/* Field: Transmit_SOP_message : Transmit SOP* message
000b: Transmit SOP
001b: Transmit SOP'
010b: Transmit SOP''
011b: Transmit SOP_DBG'
100b: Transmit SOP_DBG''
101b: Transmit Hard Reset
110b: Transmit Cable Reset
111b: Transmit BIST Carrier Mode 2 (TCPC shall exit the BIST mode no later than tBISTContMode max)
*/

